#include <iostream>
#include "game_logic/Game.h"

//Напишіть гру хрестики-нулики або аналогічну.
//Вимога: гра повинна дозволяти за кожну із сторін грати людині та, мінімум, двом видам АІ.
//Важливо, що додавання нових видів АІ повинне бути простим!
//Сам АІ може бути як завгодно примітивним -- це не є ціллю завдання. Однак -- чим він потужніший, тим краще.
//Інтерфейс може бути консольним або GUI.
//Однак, перевірка невірного вводу користувачів, зокрема -- неможливих ходів, обов'язкова


int main() {
	auto game = Game();
	return 0;
}